BASE_URL = "https://qa-scooter.praktikum-services.ru/"
DZEN_DOMAIN = "dzen.ru"

ORDER_DATA_1 = {
    "name": "Иван",
    "surname": "Петров",
    "address": "ул. Ленина, д. 1",
    "metro": "Черкизовская",
    "phone": "+79991112233",
    "date": "25.12.2025",
    "rental_period": "сутки",
    "color": "чёрный жемчуг",
    "comment": "Позвоните перед доставкой",
}

ORDER_DATA_2 = {
    "name": "Анна",
    "surname": "Сидорова",
    "address": "пр. Мира, д. 10, кв. 5",
    "metro": "Сокольники",
    "phone": "+79994445566",
    "date": "30.12.2025",
    "rental_period": "двое суток",
    "color": "серая безысходность",
    "comment": "Оставить у подъезда",
}

FAQ_DATA = [
    (1, "Сутки — 400 рублей. Оплата курьеру — наличными или картой."),
    (2, "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."),
    (3, "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."),
    (4, "Только начиная с завтрашнего дня. Но скоро станем расторопнее."),
    (5, "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."),
    (6, "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."),
    (7, "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."),
    (8, "Да, обязательно. Всем самокатов! И Москве, и Московской области."),
]